In [1]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = 'all'

In [2]:
import numpy as np 
import os

import pandas as pd

In [3]:
df = pd.read_csv(r"C:\Users\kisho\OneDrive\Desktop\All semesters\Innomatics #405\2_EDA\Task_210825_Employee_Survey\employee_survey.csv")
df

,EmpID,Gender,Age,MaritalStatus,JobLevel,Experience,Dept,EmpType,WLB,WorkEnv,...,SleepHours,CommuteMode,CommuteDistance,NumCompanies,TeamSize,NumReports,EduLevel,haveOT,TrainingHoursPerYear,JobSatisfaction
0,6,Male,32,Married,Mid,7,IT,Full-Time,1,1,...,7.6,Car,20,3,12,0,Bachelor,True,33.5,5
1,11,Female,34,Married,Mid,12,Finance,Full-Time,1,1,...,7.9,Car,15,4,11,0,Bachelor,False,36.0,5
2,33,Female,23,Single,Intern/Fresher,1,Marketing,Full-Time,2,4,...,6.5,Motorbike,17,0,30,0,Bachelor,True,10.5,5
3,20,Female,29,Married,Junior,6,IT,Contract,2,2,...,7.5,Public Transport,13,2,9,0,Bachelor,True,23.0,5
4,28,Other,23,Single,Junior,1,Sales,Part-Time,3,1,...,4.9,Car,20,0,7,0,Bachelor,False,20.5,5
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3020,2070,Male,47,Married,Lead,16,Marketing,Part-Time,1,3,...,6.8,Public Transport,15,8,28,8,Master,False,58.0,1
3021,2072,Female,47,Married,Lead,8,IT,Contract,3,1,...,6.9,Car,28,8,21,8,Master,True,54.0,1
3022,2145,Male,41,Married,Lead,17,IT,Full-Time,1,1,...,6.1,Public Transport,9,6,23,3,Master,True,58.5,1
3023,2168,Female,54,Married,Lead,16,IT,Full-Time,1,5,...,7.7,Public Transport,18,10,30,7,Master,True,58.0,1
3024,2183,Female,44,Married,Lead,22,Marketing,Full-Time,3,3,...,6.2,Car,10,7,29,4,PhD,False,61.0,1

In [14]:
df.head()
df.tail()
df.shape
df.columns
df.dtypes
df.info()

,EmpID,Gender,Age,MaritalStatus,JobLevel,Experience,Dept,EmpType,WLB,WorkEnv,...,SleepHours,CommuteMode,CommuteDistance,NumCompanies,TeamSize,NumReports,EduLevel,haveOT,TrainingHoursPerYear,JobSatisfaction
0,6,Male,32,Married,Mid,7,IT,Full-Time,1,1,...,7.6,Car,20,3,12,0,Bachelor,True,33.5,5
1,11,Female,34,Married,Mid,12,Finance,Full-Time,1,1,...,7.9,Car,15,4,11,0,Bachelor,False,36.0,5
2,33,Female,23,Single,Intern/Fresher,1,Marketing,Full-Time,2,4,...,6.5,Motorbike,17,0,30,0,Bachelor,True,10.5,5
3,20,Female,29,Married,Junior,6,IT,Contract,2,2,...,7.5,Public Transport,13,2,9,0,Bachelor,True,23.0,5
4,28,Other,23,Single,Junior,1,Sales,Part-Time,3,1,...,4.9,Car,20,0,7,0,Bachelor,False,20.5,5

,EmpID,Gender,Age,MaritalStatus,JobLevel,Experience,Dept,EmpType,WLB,WorkEnv,...,SleepHours,CommuteMode,CommuteDistance,NumCompanies,TeamSize,NumReports,EduLevel,haveOT,TrainingHoursPerYear,JobSatisfaction
3020,2070,Male,47,Married,Lead,16,Marketing,Part-Time,1,3,...,6.8,Public Transport,15,8,28,8,Master,False,58.0,1
3021,2072,Female,47,Married,Lead,8,IT,Contract,3,1,...,6.9,Car,28,8,21,8,Master,True,54.0,1
3022,2145,Male,41,Married,Lead,17,IT,Full-Time,1,1,...,6.1,Public Transport,9,6,23,3,Master,True,58.5,1
3023,2168,Female,54,Married,Lead,16,IT,Full-Time,1,5,...,7.7,Public Transport,18,10,30,7,Master,True,58.0,1
3024,2183,Female,44,Married,Lead,22,Marketing,Full-Time,3,3,...,6.2,Car,10,7,29,4,PhD,False,61.0,1

(3025, 23)

Index(['EmpID', 'Gender', 'Age', 'MaritalStatus', 'JobLevel', 'Experience',
       'Dept', 'EmpType', 'WLB', 'WorkEnv', 'PhysicalActivityHours',
       'Workload', 'Stress', 'SleepHours', 'CommuteMode', 'CommuteDistance',
       'NumCompanies', 'TeamSize', 'NumReports', 'EduLevel', 'haveOT',
       'TrainingHoursPerYear', 'JobSatisfaction'],
      dtype='object')

EmpID                      int64
Gender                    object
Age                        int64
MaritalStatus             object
JobLevel                  object
Experience                 int64
Dept                      object
EmpType                   object
WLB                        int64
WorkEnv                    int64
PhysicalActivityHours    float64
Workload                   int64
Stress                     int64
SleepHours               float64
CommuteMode               object
CommuteDistance            int64
NumCompanies               int64
TeamSize                   int64
NumReports                 int64
EduLevel                  object
haveOT                      bool
TrainingHoursPerYear     float64
JobSatisfaction            int64
dtype: object

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3025 entries, 0 to 3024
Data columns (total 23 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   EmpID                  3025 non-null   int64
 1   Gender                 3025 non-null   object
 2   Age                    3025 non-null   int64
 3   MaritalStatus          3025 non-null   object
 4   JobLevel               3025 non-null   object
 5   Experience             3025 non-null   int64
 6   Dept                   3025 non-null   object
 7   EmpType                3025 non-null   object
 8   WLB                    3025 non-null   int64
 9   WorkEnv                3025 non-null   int64
 10  PhysicalActivityHours  3025 non-null   float64
 11  Workload               3025 non-null   int64
 12  Stress                 3025 non-null   int64
 13  SleepHours             3025 non-null   float64
 14  CommuteMode            3025 non-null   object
 15  CommuteDistance        3025 non-null   int64
 16  NumCompanies           3025 non-null   int64
 17  TeamSize               3025 non-null   int64
 18  NumReports             3025 non-null   int64
 19  EduLevel               3025 non-null   object
 20  haveOT                 3025 non-null   bool
 21  TrainingHoursPerYear   3025 non-null   float64
 22  JobSatisfaction        3025 non-null   int64
dtypes: bool(1), float64(3), int64(12), object(7)
memory usage: 523.0+ KB

In [15]:
df.describe()
df.describe(include='all')
df.isnull().sum()
df.nunique()
df['Dept'].unique()

,EmpID,Age,Experience,WLB,WorkEnv,PhysicalActivityHours,Workload,Stress,SleepHours,CommuteDistance,NumCompanies,TeamSize,NumReports,TrainingHoursPerYear,JobSatisfaction
count,3025.000000,3025.000000,3025.000000,3025.000000,3025.000000,3025.000000,3025.000000,3025.000000,3025.000000,3025.000000,3025.000000,3025.000000,3025.000000,3025.000000,3025.000000
mean,1513.000000,35.741818,9.082645,3.061157,3.029091,2.029620,2.966612,1.736529,7.005983,13.473719,4.253554,16.516033,2.383140,37.301653,3.386777
std,873.386608,10.191833,7.073344,1.447001,1.415317,0.966014,1.401486,1.064242,1.002652,8.395249,3.382501,6.638419,3.058131,13.569772,1.260599
min,1.000000,22.000000,0.000000,1.000000,1.000000,0.000000,1.000000,1.000000,4.000000,1.000000,0.000000,5.000000,0.000000,10.000000,1.000000
25%,757.000000,27.000000,3.000000,2.000000,2.000000,1.300000,2.000000,1.000000,6.300000,6.000000,1.000000,11.000000,0.000000,23.500000,3.000000
50%,1513.000000,34.000000,8.000000,3.000000,3.000000,2.000000,3.000000,1.000000,7.000000,13.000000,4.000000,16.000000,0.000000,40.000000,4.000000
75%,2269.000000,43.000000,14.000000,4.000000,4.000000,2.700000,4.000000,2.000000,7.700000,21.000000,7.000000,22.000000,5.000000,46.500000,4.000000
max,3025.000000,60.000000,29.000000,5.000000,5.000000,5.000000,5.000000,5.000000,10.000000,29.000000,12.000000,30.000000,9.000000,64.500000,5.000000

,EmpID,Gender,Age,MaritalStatus,JobLevel,Experience,Dept,EmpType,WLB,WorkEnv,...,SleepHours,CommuteMode,CommuteDistance,NumCompanies,TeamSize,NumReports,EduLevel,haveOT,TrainingHoursPerYear,JobSatisfaction
count,3025.000000,3025,3025.000000,3025,3025,3025.000000,3025,3025,3025.000000,3025.000000,...,3025.000000,3025,3025.000000,3025.000000,3025.000000,3025.000000,3025,3025,3025.000000,3025.000000
unique,NaN,3,NaN,4,5,NaN,8,3,NaN,NaN,...,NaN,5,NaN,NaN,NaN,NaN,4,2,NaN,NaN
top,NaN,Male,NaN,Single,Senior,NaN,IT,Full-Time,NaN,NaN,...,NaN,Car,NaN,NaN,NaN,NaN,Bachelor,False,NaN,NaN
freq,NaN,1528,NaN,1437,1069,NaN,774,2077,NaN,NaN,...,NaN,1087,NaN,NaN,NaN,NaN,2300,2089,NaN,NaN
mean,1513.000000,NaN,35.741818,NaN,NaN,9.082645,NaN,NaN,3.061157,3.029091,...,7.005983,NaN,13.473719,4.253554,16.516033,2.383140,NaN,NaN,37.301653,3.386777
std,873.386608,NaN,10.191833,NaN,NaN,7.073344,NaN,NaN,1.447001,1.415317,...,1.002652,NaN,8.395249,3.382501,6.638419,3.058131,NaN,NaN,13.569772,1.260599
min,1.000000,NaN,22.000000,NaN,NaN,0.000000,NaN,NaN,1.000000,1.000000,...,4.000000,NaN,1.000000,0.000000,5.000000,0.000000,NaN,NaN,10.000000,1.000000
25%,757.000000,NaN,27.000000,NaN,NaN,3.000000,NaN,NaN,2.000000,2.000000,...,6.300000,NaN,6.000000,1.000000,11.000000,0.000000,NaN,NaN,23.500000,3.000000
50%,1513.000000,NaN,34.000000,NaN,NaN,8.000000,NaN,NaN,3.000000,3.000000,...,7.000000,NaN,13.000000,4.000000,16.000000,0.000000,NaN,NaN,40.000000,4.000000
75%,2269.000000,NaN,43.000000,NaN,NaN,14.000000,NaN,NaN,4.000000,4.000000,...,7.700000,NaN,21.000000,7.000000,22.000000,5.000000,NaN,NaN,46.500000,4.000000
max,3025.000000,NaN,60.000000,NaN,NaN,29.000000,NaN,NaN,5.000000,5.000000,...,10.000000,NaN,29.000000,12.000000,30.000000,9.000000,NaN,NaN,64.500000,5.000000

EmpID                    0
Gender                   0
Age                      0
MaritalStatus            0
JobLevel                 0
Experience               0
Dept                     0
EmpType                  0
WLB                      0
WorkEnv                  0
PhysicalActivityHours    0
Workload                 0
Stress                   0
SleepHours               0
CommuteMode              0
CommuteDistance          0
NumCompanies             0
TeamSize                 0
NumReports               0
EduLevel                 0
haveOT                   0
TrainingHoursPerYear     0
JobSatisfaction          0
dtype: int64

EmpID                    3025
Gender                      3
Age                        39
MaritalStatus               4
JobLevel                    5
Experience                 30
Dept                        8
EmpType                     3
WLB                         5
WorkEnv                     5
PhysicalActivityHours      51
Workload                    5
Stress                      5
SleepHours                 60
CommuteMode                 5
CommuteDistance            29
NumCompanies               13
TeamSize                   26
NumReports                 10
EduLevel                    4
haveOT                      2
TrainingHoursPerYear       79
JobSatisfaction             5
dtype: int64

array(['IT', 'Finance', 'Marketing', 'Sales', 'Operations',
       'Customer Service', 'Legal', 'HR'], dtype=object)

### 1. How satisfied are employees with their current roles based on survey responses?

In [22]:
df['JobSatisfaction'].value_counts()

JobSatisfaction
4    1249
3     566
5     516
1     417
2     277
Name: count, dtype: int64

### 3. What is the average job satisfaction score for each department?

In [23]:
df.groupby('Dept')['JobSatisfaction'].mean()

Dept
Customer Service    3.312925
Finance             3.437991
HR                  3.398601
IT                  3.282946
Legal               3.393382
Marketing           3.348101
Operations          3.465934
Sales               3.498221
Name: JobSatisfaction, dtype: float64

### 4. How many employees are in each age group?

In [24]:
df['Age'].value_counts().sort_index()

Age
22    159
23    167
24    157
25    108
26    106
27     93
28    111
29    107
30    103
31    112
32    103
33    112
34    102
35    101
36    122
37    115
38     92
39     92
40    107
41     44
42     40
43     50
44     50
45     50
46     42
47     56
48     63
49     51
50     59
51     52
52     49
53     61
54     58
55     12
56     19
57     21
58     25
59     31
60     23
Name: count, dtype: int64

### 5. What is the average years of service for each education level?

In [25]:
df.groupby('EduLevel')['Experience'].mean()

EduLevel
Bachelor        9.145652
High School     1.600000
Master         11.897368
PhD            15.270000
Name: Experience, dtype: float64

### 6. Which departments have the highest and lowest employee engagement scores?

In [26]:
df.groupby('Dept')['WorkEnv'].mean().sort_values(ascending=False)

Dept
IT                  3.118863
Operations          3.109890
Sales               3.049822
HR                  3.041958
Legal               3.011029
Finance             3.009419
Customer Service    2.938776
Marketing           2.765823
Name: WorkEnv, dtype: float64

### 7. How many employees in each department have a "Very Satisfied" job satisfaction score?

In [27]:
df[df['JobSatisfaction'] == 5].groupby('Dept')['EmpID'].count()

Dept
Customer Service     21
Finance             124
HR                   22
IT                  126
Legal                36
Marketing            52
Operations           84
Sales                51
Name: EmpID, dtype: int64

### 8. What is the average workload for each job role?

In [28]:
df.groupby('JobLevel')['Workload'].mean()

JobLevel
Intern/Fresher    2.965347
Junior            3.046512
Lead              3.049223
Mid               2.889034
Senior            2.947615
Name: Workload, dtype: float64

### 11. What are the top 5 job roles with the highest average employee engagement scores?

In [29]:
df.groupby('JobLevel')['WorkEnv'].mean().sort_values(ascending=False).head(5)

JobLevel
Lead              3.163212
Intern/Fresher    3.094059
Senior            3.040225
Junior            2.990033
Mid               2.959530
Name: WorkEnv, dtype: float64

### 12. Which employees have the lowest work-life balance scores, sorted by score?

In [30]:
df[['EmpID', 'Dept', 'JobLevel', 'WLB']].sort_values(by='WLB', ascending=True)

      EmpID              Dept JobLevel  WLB
1840     47             Legal   Senior    1
2751   1245             Legal   Senior    1
2752   1252  Customer Service   Senior    1
113    2885        Operations   Senior    1
115    2888                IT      Mid    1
...     ...               ...      ...  ...
11       32             Legal   Senior    5
10       18  Customer Service      Mid    5
9        15         Marketing      Mid    5
36      920           Finance   Junior    5
2989   1430           Finance     Lead    5

[3025 rows x 4 columns]

### 14. What are the details of employees in the "Sales" department?

In [31]:
df[df['Dept'] == 'Sales']

,EmpID,Gender,Age,MaritalStatus,JobLevel,Experience,Dept,EmpType,WLB,WorkEnv,...,SleepHours,CommuteMode,CommuteDistance,NumCompanies,TeamSize,NumReports,EduLevel,haveOT,TrainingHoursPerYear,JobSatisfaction
4,28,Other,23,Single,Junior,1,Sales,Part-Time,3,1,...,4.9,Car,20,0,7,0,Bachelor,False,20.5,5
6,21,Female,26,Single,Junior,4,Sales,Full-Time,2,2,...,5.8,Car,29,1,8,0,Bachelor,True,22.0,5
15,151,Male,28,Married,Senior,6,Sales,Full-Time,4,5,...,8.3,Bike,3,2,16,7,Bachelor,False,43.0,5
16,173,Female,26,Single,Mid,4,Sales,Part-Time,5,5,...,7.8,Walk,2,1,15,0,Bachelor,False,32.0,5
45,1200,Female,32,Married,Senior,8,Sales,Contract,4,5,...,6.5,Public Transport,9,3,17,2,Bachelor,False,44.0,5
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2969,991,Male,40,Married,Lead,18,Sales,Full-Time,4,1,...,6.1,Car,25,6,28,5,PhD,False,59.0,3
2978,1095,Female,44,Married,Lead,6,Sales,Contract,3,5,...,7.2,Car,26,7,26,4,PhD,False,53.0,2
2993,751,Female,50,Married,Lead,21,Sales,Full-Time,1,2,...,6.8,Motorbike,18,9,23,5,PhD,True,60.5,1
2995,863,Male,57,Married,Lead,16,Sales,Full-Time,3,4,...,7.9,Car,18,11,27,3,PhD,False,58.0,1
2999,1089,Male,56,Married,Lead,4,Sales,Full-Time,2,3,...,5.2,Car,10,11,22,7,PhD,False,52.0,1

### 15. How many employees are in the "IT" department and what are their job satisfaction scores?

In [32]:
df[df['Dept'] == 'IT'][['EmpID', 'JobSatisfaction']]

      EmpID  JobSatisfaction
0         6                5
3        20                5
7        44                5
24      406                5
33      739                5
...     ...              ...
3016   1939                1
3019   2000                1
3021   2072                1
3022   2145                1
3023   2168                1

[774 rows x 2 columns]

### 16. What is the average employee engagement score for the "Marketing" department?

In [33]:
df[df['Dept'] == 'Marketing']['WorkEnv'].mean()

np.float64(2.7658227848101267)

### 17. What is the distribution of employee engagement scores across all employees?

In [34]:
df['WorkEnv'].value_counts().sort_index()

WorkEnv
1    580
2    604
3    631
4    568
5    642
Name: count, dtype: int64

### 18. How many employees belong to each job role?

In [35]:
df['JobLevel'].value_counts()

JobLevel
Senior            1069
Mid                766
Junior             602
Lead               386
Intern/Fresher     202
Name: count, dtype: int64